Repository: jgodeyne/billiardresults
Catalog: app/lib/l10n/app_*.arb
Languages: fr, nl

# appTitle
source: CaromStats
fr: Résultats de Billard
nl: Biljart Resultaten

source: Dashboard
fr: Tableau de bord

source: results
fr: Résultats
nl: Resultaten

source: Settings
fr: Paramètres
nl: Instellingen

# onboardingWelcome
source: Welcome to CaromStats!
fr: Bienvenue dans Résultats de Billard!
nl: Welkom bij Biljart Resultaten!

# onboardingSubtitle
source: Let's set up your profile
fr: Configurons votre profil
nl: Laten we je profiel instellen

# nameLabel
source: Your Name
fr: Votre Nom
nl: Je Naam

# nameHint
source: Enter your name
fr: Entrez votre nom
nl: Voer je naam in

# nameError
source: Please enter your name
fr: Veuillez entrer votre nom
nl: Voer je naam in

# seasonStartLabel
source: Season Start Date
fr: Date de Début de Saison
nl: Seizoen Startdatum

# seasonStartHint
source: Select day and month
fr: Sélectionnez le jour et le mois
nl: Selecteer dag en maand

# seasonStartError
source: Please select a season start date
fr: Veuillez sélectionner une date de début de saison
nl: Selecteer een seizoen startdatum

source: Get Started
fr: Commencer
nl: Aan de slag

source: Save
fr: Enregistrer
nl: Opslaan

source: Cancel
fr: Annuler
nl: Annuleren

source: Delete
fr: Supprimer
nl: Verwijderen

source: Confirm
fr: Confirmer
nl: Bevestigen

source: Edit Profile
fr: Modifier le Profil
nl: Profiel Bewerken

# languageLabel
source: Language
fr: Langue
nl: Taal

source: English
fr: Anglais
nl: Engels

source: Dutch
fr: Néerlandais
nl: Nederlands

source: French
fr: Français
nl: Frans

source: Classification Levels
fr: Niveaux de Classification
nl: Classificatieniveaus

# classificationLevelsSubtitle
source: Set target average ranges per discipline
fr: Définir les plages de moyenne cible par discipline
nl: Stel doelgemiddelden in per discipline

# noDisciplines
source: No disciplines yet. Add results to set classification levels.
fr: Aucune discipline pour le moment. Ajoutez des résultats pour définir les niveaux de classification.
nl: Nog geen disciplines. Voeg resultaten toe om classificatieniveaus in te stellen.

source: Minimum Average
fr: Moyenne Minimale
nl: Minimum Gemiddelde

source: Maximum Average
fr: Moyenne Maximale
nl: Maximum Gemiddelde

source: Average Range
fr: Plage de Moyenne
nl: Gemiddelde Bereik

source: Not set
fr: Non défini
nl: Niet ingesteld

source: Data Management
fr: Gestion des Données
nl: Gegevensbeheer

# importData
source: Import from CSV
fr: Importer depuis CSV

# importDataDescription
source: Import results from a CSV file exported from Numbers or Excel
fr: Importez les résultats depuis un fichier CSV exporté depuis Numbers ou Excel

source: Select CSV File
fr: Sélectionner le Fichier CSV

source: Import Preview
fr: Aperçu de l'Importation

source: Import Results
fr: Importer les Résultats

# importSuccess
source: Successfully imported {count} results
fr: {count} résultats importés avec succès

# importErrors
source: Import completed with {errorCount} errors
fr: Importation terminée avec {errorCount} erreurs

source: Import failed
fr: Échec de l'importation

source: No file selected
fr: Aucun fichier sélectionné

source: CSV Format Help
fr: Aide sur le Format CSV

# csvFormatDescription
source: Your CSV file must have these columns: Required: • Date (YYYY-MM-DD, DD/MM/YYYY, or MM/DD/YYYY) • Discipline • Points • Innings • Highest Run Optional: • Adversary • Competition • Outcome (won/lost/draw)
fr: Votre fichier CSV doit avoir ces colonnes: Obligatoire: • Date (AAAA-MM-JJ, JJ/MM/AAAA, ou MM/JJ/AAAA) • Discipline • Points • Manches • Série la Plus Élevée Optionnel: • Adversaire • Compétition • Résultat (won/lost/draw)

# downloadExample
source: Download Example CSV
fr: Télécharger Exemple CSV

# importConfirmTitle
source: Import {count} Results?
fr: Importer {count} Résultats?

# importConfirmMessage
source: This will add {count} results to your database. Continue?
fr: Cela ajoutera {count} résultats à votre base de données. Continuer?

source: Cloud Backup
fr: Sauvegarde Cloud

source: Backup to Cloud
fr: Sauvegarder vers le Cloud

source: Restore from Cloud
fr: Restaurer depuis le Cloud

# backupToICloud
source: Backup your data to iCloud Drive
fr: Sauvegardez vos données vers iCloud Drive

# backupToGoogleDrive
source: Backup your data to Google Drive
fr: Sauvegardez vos données vers Google Drive

# restoreFromICloud
source: Restore your data from iCloud Drive
fr: Restaurez vos données depuis iCloud Drive

# restoreFromGoogleDrive
source: Restore your data from Google Drive
fr: Restaurez vos données depuis Google Drive

source: Last Backup
fr: Dernière Sauvegarde

source: Never
fr: Jamais

source: Backing up...
fr: Sauvegarde en cours...

source: Restoring...
fr: Restauration en cours...

source: Backup successful
fr: Sauvegarde réussie

source: Backup failed
fr: Échec de la sauvegarde

source: Restore successful
fr: Restauration réussie

source: Restore failed
fr: Échec de la restauration

# noBackupFound
source: No backup found in cloud
fr: Aucune sauvegarde trouvée dans le cloud

# restoreConfirmTitle
source: Restore from Cloud?
fr: Restaurer depuis le Cloud?

# restoreConfirmMessage
source: This will replace all your current data with the backup. This action cannot be undone. Continue?
fr: Cela remplacera toutes vos données actuelles par la sauvegarde. Cette action ne peut pas être annulée. Continuer?

source: Sign in to Google
fr: Se connecter à Google

# signedInAs
source: Signed in as {email}
fr: Connecté en tant que {email}

source: Sign Out
fr: Se Déconnecter

source: Delete All Data
fr: Supprimer Toutes les Données
nl: Alle Gegevens Verwijderen

# deleteAllDataConfirmTitle
source: Delete All Data?
fr: Supprimer Toutes les Données?
nl: Alle Gegevens Verwijderen?

# deleteAllDataConfirmMessage
source: This will permanently delete all your results, classification levels, and settings. This action cannot be undone.
fr: Cela supprimera définitivement tous vos résultats, niveaux de classification et paramètres. Cette action ne peut pas être annulée.
nl: Dit zal permanent al je resultaten, classificatieniveaus en instellingen verwijderen. Deze actie kan niet ongedaan worden gemaakt.

# deleteClassificationTitle
source: Delete Classification?
fr: Supprimer la Classification?
nl: Classificatie Verwijderen?

# deleteClassificationMessage
source: Remove classification level for {discipline}?
fr: Supprimer le niveau de classification pour {discipline}?
nl: Classificatieniveau verwijderen voor {discipline}?

# dataDeleted
source: All data has been deleted
fr: Toutes les données ont été supprimées
nl: Alle gegevens zijn verwijderd

# settingsSaved
source: Settings saved successfully
fr: Paramètres enregistrés avec succès
nl: Instellingen succesvol opgeslagen

# classificationSaved
source: Classification level saved
fr: Niveau de classification enregistré
nl: Classificatieniveau opgeslagen

# classificationDeleted
source: Classification level deleted
fr: Niveau de classification supprimé
nl: Classificatieniveau verwijderd

source: Error saving settings
fr: Erreur lors de l'enregistrement des paramètres
nl: Fout bij opslaan instellingen

source: Error loading settings
fr: Erreur lors du chargement des paramètres
nl: Fout bij laden instellingen

source: January
fr: Janvier
nl: Januari

source: February
fr: Février
nl: Februari

source: March
fr: Mars
nl: Maart

source: April
fr: Avril

source: May
fr: Mai
nl: Mei

source: June
fr: Juin
nl: Juni

source: July
fr: Juillet
nl: Juli

source: August
fr: Août
nl: Augustus

source: September
fr: Septembre

source: October
fr: Octobre
nl: Oktober

source: November
fr: Novembre

source: December
fr: Décembre

source: Add Result
fr: Ajouter Résultat
nl: Resultaat Toevoegen

source: Edit Result
fr: Éditer le Résultat
nl: Resultaat Bewerken

# disciplineHint
source: Select or enter discipline
fr: Sélectionner ou entrer discipline
nl: Selecteer of voer discipline in

# disciplineError
source: Please enter a discipline
fr: Veuillez entrer une discipline
nl: Voer een discipline in

# dateHint
source: Select date
fr: Sélectionner la date
nl: Selecteer datum

# pointsMadeLabel
source: Points Made
fr: Points Marqués
nl: Caramboles

# pointsMadeHint
source: Enter points made
fr: Entrez les points marqués
nl: Voer caramboles in

# pointsMadeError
source: Points must be 0 or greater
fr: Les points doivent être 0 ou plus
nl: Caramboles moet 0 of hoger zijn

# inningsLabel
source: Number of Innings
fr: Nombre de Reprises
nl: Aantal Beurten

# inningsHint
source: Enter number of innings
fr: Entrez le nombre de reprises
nl: Voer aantal beurten in

# inningsError
source: Innings must be greater than 0
fr: Les reprises doivent être supérieures à 0
nl: Beurten moet groter zijn dan 0

# highestRunLabel
source: Highest Run
fr: Série Maximum
nl: Hoogste Serie

# highestRunHint
source: Enter highest run
fr: Entrez la série maximum
nl: Voer hoogste serie in

# highestRunError
source: Highest run must be between 0 and points made
fr: La série maximum doit être entre 0 et les points marqués
nl: Hoogste serie moet tussen 0 en caramboles liggen

# adversaryLabel
source: Adversary (Optional)
fr: Adversaire (Optionnel)
nl: Tegenstander (Optioneel)

# adversaryHint
source: Enter opponent name
fr: Entrez le nom de l'adversaire
nl: Voer naam tegenstander in

# outcomeLabel
source: Match Outcome (Optional)
fr: Résultat du Match (Optionnel)
nl: Wedstrijduitslag (Optioneel)

# outcomeWon
source: Won
fr: Gagné
nl: Gewonnen

# outcomeLost
source: Lost
fr: Perdu
nl: Verloren

# outcomeDraw
source: Draw
fr: Nul
nl: Gelijk

# outcomeUnknown
source: Unknown
fr: Inconnu
nl: Onbekend

# competitionLabel
source: Competition
fr: Compétition (Optionnelle)
nl: Competitie (Optioneel)

# competitionHint
source: Enter competition name
fr: Entrez le nom de la compétition
nl: Voer competitie naam in

# resultSaved
source: Result saved successfully
fr: Résultat enregistré avec succès
nl: Resultaat succesvol opgeslagen

source: Result deleted
fr: Résultat supprimé
nl: Resultaat verwijderd

source: Error saving result
fr: Erreur lors de l'enregistrement du résultat
nl: Fout bij opslaan resultaat

# deleteResultTitle
source: Delete Result?
fr: Supprimer le Résultat?
nl: Resultaat Verwijderen?

# deleteResultMessage
source: This will permanently delete this result.
fr: Cela supprimera définitivement ce résultat.
nl: Dit zal dit resultaat permanent verwijderen.

# warningHighPoints
source: Warning: Points value seems high (>{limit}). Please verify.
fr: Attention: Valeur de points semble élevée (>{limit}). Veuillez vérifier.
nl: Waarschuwing: Caramboles waarde lijkt hoog (>{limit}). Controleer a.u.b.

# warningHighInnings
source: Warning: Innings value seems high (>{limit}). Please verify.
fr: Attention: Valeur de reprises semble élevée (>{limit}). Veuillez vérifier.
nl: Waarschuwing: Beurten waarde lijkt hoog (>{limit}). Controleer a.u.b.

# warningHighRun
source: Warning: Highest run seems high (>{limit}). Please verify.
fr: Attention: Série maximum semble élevée (>{limit}). Veuillez vérifier.
nl: Waarschuwing: Hoogste serie lijkt hoog (>{limit}). Controleer a.u.b.

source: Required fields
fr: Champs obligatoires
nl: Verplichte velden

source: Optional fields
fr: Champs optionnels
nl: Optionele velden

source: Average
fr: Moyenne
nl: Gemiddelde

# disciplineFreeSmall
source: Free game - Small table
fr: Partie libre - Petite table
nl: Vrij spel - Klein biljart

# disciplineFreeMatch
source: Free game - Match table
fr: Partie libre - Table de match
nl: Vrij spel - Match biljart

# discipline1CushionSmall
source: 1-cushion - Small table
fr: 1 bande - Petite table
nl: 1-band - Klein biljart

# discipline1CushionMatch
source: 1-cushion - Match table
fr: 1 bande - Table de match
nl: 1-band - Match biljart

# discipline3CushionSmall
source: 3-cushion - Small table
fr: 3 bandes - Petite table
nl: 3-banden - Klein biljart

# discipline3CushionMatch
source: 3-cushion - Match table
fr: 3 bandes - Table de match
nl: 3-banden - Match biljart

# disciplineBalkline382Small
source: Balkline 38/2 - Small table
fr: Cadre 38/2 - Petite table
nl: Kader 38/2 - Klein biljart

# disciplineBalkline572Small
source: Balkline 57/2 - Small table
fr: Cadre 57/2 - Petite table
nl: Kader 57/2 - Klein biljart

# disciplineBalkline472Match
source: Balkline 47/2 - Match table
fr: Cadre 47/2 - Table de match
nl: Kader 47/2 - Match biljart

# disciplineBalkline471Match
source: Balkline 47/1 - Match table
fr: Cadre 47/1 - Table de match
nl: Kader 47/1 - Match biljart

# disciplineBalkline712Match
source: Balkline 71/2 - Match table
fr: Cadre 71/2 - Table de match
nl: Kader 71/2 - Match biljart

source: Current Season
fr: Saison Actuelle
nl: Huidig Seizoen

source: Select Season
fr: Sélectionner la Saison
nl: Selecteer Seizoen

source: No results yet
fr: Aucun résultat pour l'instant
nl: Nog geen resultaten

# addFirstResult
source: Tap the + button to add your first result
fr: Appuyez sur le bouton + pour ajouter votre premier résultat
nl: Tik op de + knop om je eerste resultaat toe te voegen

# noResultsThisSeason
source: No results for this season
fr: Aucun résultat pour cette saison
nl: Geen resultaten voor dit seizoen

source: Total Points
fr: Points Totaux
nl: Totaal Caramboles

source: Total Innings
fr: Reprises Totales
nl: Totaal Beurten

source: Highest Run
fr: Série Maximum
nl: Hoogste Serie

source: Matches
fr: Parties
nl: Partijen

# won
source: W
fr: G

# lost
source: L
fr: P
nl: V

# draw
source: D
fr: N
nl: G

# detailTitle
source: {discipline} Details
fr: {discipline} Détails

source: Average Evolution
fr: Évolution de la Moyenne
nl: Evolutie Gemiddelde

source: Highest Run Evolution
fr: Évolution de la Série Maximale
nl: Evolutie Hoogste Serie

# outcomeRatio
source: Win/Loss/Draw Ratio
fr: Ratio Victoire/Défaite/Égalité
nl: Winst/Verlies/Gelijk Verhouding

source: All Seasons
fr: Toutes les Saisons
nl: Alle Seizoenen

source: Performance Trend
fr: Tendance de Performance
nl: Prestatie Trend

source: Improving
fr: En Amélioration
nl: Verbeterend

source: Declining
fr: En Baisse
nl: Dalend

# tapToViewResults
source: Tap any graph to view results
fr: Appuyez sur n'importe quel graphique pour voir les résultats
nl: Tik op een grafiek om resultaten te bekijken

source: No data available
fr: Aucune donnée disponible
nl: Geen gegevens beschikbaar

source: Match #{number}
fr: Partie #{number}
nl: Partij #{number}

source: Above Target
fr: Au-dessus de l'Objectif
nl: Boven Doel

source: Below Target
fr: En-dessous de l'Objectif
nl: Onder Doel

source: Within Target
fr: Dans l'Objectif
nl: Binnen Doel

# resultList
source: Results
fr: Résultats
nl: Resultaten

source: Filter Results
fr: Filtrer les Résultats
nl: Filter Resultaten

source: Filter by Competition
fr: Filtrer par Compétition
nl: Filter op Competitie

source: Filter by Adversary
fr: Filtrer par Adversaire
nl: Filter op Tegenstander

source: All Competitions
fr: Toutes les Compétitions
nl: Alle Competities

source: All Adversaries
fr: Tous les Adversaires
nl: Alle Tegenstanders

source: Apply Filters
fr: Appliquer les Filtres
nl: Filters Toepassen

source: Clear Filters
fr: Effacer les Filtres
nl: Filters Wissen

# noMatchingResults
source: No results match the selected filters
fr: Aucun résultat ne correspond aux filtres sélectionnés
nl: Geen resultaten komen overeen met de geselecteerde filters

source: Delete Result
fr: Supprimer le Résultat
nl: Resultaat Verwijderen

source: Confirm Delete
fr: Confirmer la Suppression
nl: Verwijdering Bevestigen

# confirmDeleteMessage
source: Are you sure you want to delete this result? This action cannot be undone.
fr: Êtes-vous sûr de vouloir supprimer ce résultat? Cette action ne peut pas être annulée.
nl: Weet u zeker dat u dit resultaat wilt verwijderen? Deze actie kan niet ongedaan worden gemaakt.

source: Result updated
fr: Résultat mis à jour
nl: Resultaat bijgewerkt

# dateLabel
source: Date
nl: Datum

source: Stable
nl: Stabiel
